Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Of course, this assumes that the sprites, images, and sounds you used to make it can be distributed or sold as well and that you have the legal rights to all assets.
zh_cn: 当然，前提是所有的游戏资源都是你自己制作的。

source: Often it is used to create a rotating minimap, or to "shake" the view for example.
zh_cn: 经常用于创建旋转的迷你地图，或者视野震动效果。

source: Okay, we can use an array for those things mentioned above, but what is an array?
zh_cn: 好的，上述情况可以使用数组，不过数组是什么呢？

source: On Android, all notifications received when the app is not running/in background, will be stored, and the data delivered by the async event the next time the app runs.
zh_cn: 在 Android 平台， 无论 程序是在运行状态还是后台状态，数据都将被存储下来，并通过异步事件的形式在程序下一次运行时被传送。

source: On Tizen, local notifications are not supported.
zh_cn: 在 Tizen 平台, 本地通知是 不被支持的。

source: On iOS, data for a particular notification will only be delivered when the notification is selected (or if the app is running in foreground when the notification is received).
zh_cn: 在 iOS 平台，一个特定的通知数据只有在通知被选择的时候数据才会传送（或者当收到通知时程序运行在前台时）。

source: On mobile devices, normally only one application can be active in the foreground at any time, but many games and applications operate in a time-based or interconnected environment where events of interest to users can occur when the application is not in the foreground.
zh_cn: 在移动设备上,通常只有一个应用程序可以在任何时候活跃在前台,但是许多的游戏和应用程序需要基于时间或者其他特定的用户行为来触发事件， 并且不需要活跃在前台。

source: On starting GameMaker: Studio the following form is normally shown which presents you with a selection of options to choose from (unless you use the Steam Client, see below):
zh_cn: 打开 GameMaker: Studio 的默认界面见下图 (除非你使用了 Steam 客户端，见下文):

source: On the left, you can see the different resources mentioned in other sections of the manual: Sprites, Sounds, Backgrounds, Paths, Scripts, Fonts, Time Lines, Objects, Global Game Settings and finally, Extensions.
zh_cn: 在左边，你可以看到在用户手册其他部分所提到的不同的 resources (资源): Sprites (精灵)、Sounds (声音)、Backgrounds (背景)、Paths (路径)、Scripts (脚本)、Fonts (字体)、Time Lines (时间轴)、Objects (物体)、Global Game Settings (游戏全局设置) 和 Extensions (扩展)。

source: On the right you have a preview of the sprite image you select and some basic information about its size.
zh_cn: 在右边有图片的预览和一些关于文件大小的信息。

source: Once an audio file has been assigned to a group you can then use the specific audio group functions to change them and lo load/unload them from memory.
zh_cn: 一旦音频文件被分到了一组，你就可以使用特定的音频组函数改变它们或从内存中加载/卸载它们。

source: Once closed all unsubscribed games will be removed from the playlist and to re-subscribe you must search for them on the Workshop pages.
zh_cn: 如果关闭了所有退订游戏并且关闭播放器，如果想重新订阅他们，则必须在 Workshop 页面重新找到它们。

source: Once everything is correct, you then go into the File menu and select the item Create Executable or you can press the following button, found on the main IDE toolbar beside the Play and Debug buttons:
zh_cn: 一旦选择完毕，你可以点击 File 菜单并选择 Create Executable 按钮 (或者工具栏上相应的按钮):

source: Once finished you should then press the Create button to re-upload the game to the Workshop.
zh_cn: 完成之后点击 Create 按钮重新上传到创意工坊。

source: Once it has been added you can right-click on it and select "Properties" to edit the properties of the file: Here you can rename the file if you choose by changing the File Name.
zh_cn: 当文件被添加到列表中后，你可以右击它选择 "Properties" 来编辑这个文件的属性： 在这里你可以修改 File Name 这一项来重命名文件。

source: Once that is done, you can assign this time line to the guard and the guard will do exactly what you planned.
zh_cn: 完成后，你就可以把这个时间轴绑定在你的守卫上，然后这个守卫就会完全按照你计划中的那样行动了。

source: Once that is done, you should close GameMaker: Studio and restart it to enjoy the functionality of the new modules that you have purchased.
zh_cn: 做完这一步后，重启 GameMaker: Studio，并享受你所购买的新模块的功能。

source: Once the sprite is loaded you are returned to the sprite properties window where the first subimage is shown on the right of the screen.
zh_cn: 一旦加载好精灵，就会返回精灵的 properties (属性) 窗口，第一个子图像会显示在屏幕的右边。

source: Once there, all you have to do is fill in the required information (e-mail address and GameMaker: Studio base license), then select the target module or modules that you wish to add.
zh_cn: 一旦到了那一步，你仅需要填写所需的信息 (邮箱地址和 GameMaker: Studio 基本许可证)，然后选择你希望添加的目标模块或模块。

source: Once they have been downloaded, this button turns into a "Play" button and clicking it again will start the game.
zh_cn: 一旦下载完成，就会变成 "Play (运行)" 按钮，点击它就可以开始游戏。

source: Once this has been done, they will be visible in the Player (you may need to close and restart the Player for these changes to be visible) listed on the left hand side and selecting any one of them will show a screenshot, user information and also permit you to download them by clicking on the "Download" button.
zh_cn: 如果这么做了。就会看见你订阅的游戏出现在播放器列表的左侧 (你可能需要重启播放器才能看到变化)，选择其中任何一个都会显示截图、用户信息，还有Download (下载) 按钮。

source: Once you are done you reset the drawing target so that all further drawing happens on the screen again.
zh_cn: 一旦完成，重置绘制目标，再让进一步的绘制发生在屏幕上。

source: Once you become more familiar with GameMaker: Studio and want to use it to its fullest extent, it is advisable to start learning to use this language, as it greatly expands your possibilities when creating games.
zh_cn: 一旦你熟悉了 GameMaker:Studio 的使用，并且你想要发挥它最大的能力，那么强烈建议你去学习使用GML，它可以极大的扩展你创造游戏时的可能性。Once you become more familiar with GameMaker: Studio and want to use it to its fullest extent, it is advisable to start learning to use this language, as it greatly expands your possibilities when creating games.

source: Once you click on "OK" the file will be stored with your current project in its own folder called data-files found in the project *.gmx directory.
zh_cn: 一旦你点击了“OK”后文件就会被保存在你当前工程 *.gmx 文件夹下的一个叫做 data-files 的文件夹中。

source: Once you create a time line you can then assign it to an object, and the instance of that object will then execute the actions at the indicated moments of time when placed or created within a room.
zh_cn: 当你创建了一个时间轴以后，你可以绑定在一个物体上，然后这个物体的实例就会在你指定的特定时间点上执行这些动作。

source: Once you have completed the design of your rooms, you are ready to run the game.
zh_cn: 一旦完成了你的房间设计，你就可以运行游戏了。

source: Once you have created a stand-alone application or package for your game you can then give the file to other people or place it on your website to download.
zh_cn: 一旦你创建了独立应用程序或打包了你的游戏，你就可以把你的文件提供给别人或者发布到网站上供别人下载。

source: Once you have defined your objects it is time to define the rooms in which they will be placed.
zh_cn: 一旦你定义了你的物体，你应该定义他们在房间 的位置。

source: Once you have done this, the necessary files will be generated so that you can distribute it as you wish.
zh_cn: 点击确定后会生成目标程序，就可以如你所愿地发布了。

source: Once you have installed GameMaker: Studio and the gameMaker: Player, you can then run them independently and also upload your own games to the Player for others to play.
zh_cn: 一旦你安装了 Studio 和 Player， 你可以单独运行他们，也可以上传你制作的游戏到 Player 平台给其他人玩。

source: Once you have loaded your file you can preview the sound by using the play button which will loop it continuously.
zh_cn: 加载好文件后可以使用播放按钮预览音乐，这将循环播放音乐。

source: Once you have named the path, you can start to define it by placing points in the main window on the right.
zh_cn: 当你给路径起好名字后，你就可以可以通过往右侧的窗口中放置点来定义这个路径了。

source: Once you have selected the file and the options, clicking the "Open" button will load the background into GameMaker: Studio ready to be used in your games.
zh_cn: 选好了这些选项按下 Open 按钮把背景载入 GameMaker: Studio。

source: Once you have selected your data-type, the variable will then show the entries in the structure simply by clicking the small "+" next to its name.
zh_cn: 选择好了你的数据类型以后，点击它名字旁边的小"+"来让变量显示整个的结构。

source: Once you have uploaded a game, to be able to play it you must first subscribe to it by clicking on the Subscribe button of the Steam Workshop page for your games, which can be found in the Community section of the Steam Client, on the right under the Actions menu.
zh_cn: 一旦你已经上传了游戏，首先点击创意工坊里你的游戏的 Subscribe(订阅) 按钮就可以玩你的游戏了，它可以在 Steam 客户端的 社区部分右侧的 功能 菜单下找到。

source: Once you have uploaded your game to the Workshop, you may need to update it or wish to change the screenshot chosen for the description, etc...
zh_cn: 一旦你上传了游戏到创意工坊，如果想升级它或是改变截图、描述等...

source: Once you start to work with it you will find out it is a very powerful tool indeed!
zh_cn: 当你尝试过时间轴以后，你一定会发现它是一个多么有力的工具！

source: Once you've loaded or created your project in GameMaker: Studio the main GUI is shown and looks something like this:
zh_cn: 一旦加载或创建项目，你将看到这样的 GameMaker: Studio 用户图形界面:

source: One of the most common methods for accessing or changing a variable in another instance is to use its object name as an identifier and then use a point "." to tell GameMaker that the variable used after is to be assigned or changed in that object.
zh_cn: 在另外一个实例中访问或者更改一个变量，最通常的一个方法是使用物体的名字作为标识符，然后使用一个点“.”告诉 GameMaker 之后使用的变量是在那个物体中指定或者改变。

source: One of the most powerful options within the object properties is the ability to assign a parent.
zh_cn: 物体属性选项里最强大的功能就是父对了。

source: One thing that should be noted is that surfaces are stacked so you cannot jump from target to target and then reset to the normal draw target at the end, but rather you must open and close rendering targets.
zh_cn: 还有需要注意的是，表面是 堆栈形式的，你不能从一个目标跳到另外一个，最后恢复默认的绘制目标，而是必须打开和关闭渲染目标。

source: One thing to note is that should you require drawing the whole display to a surface (including tiles, backgrounds etc...) you can simply access the application surface itself (see below for further details) or you could assign a surface to a view using the variable view_surface_id[0..7]as with this all that is visible in that view will be drawn to the corresponding surface.
zh_cn: 应当注意一件事，当你需要绘制整个显示器的内容到表面上（图块、背景等），你可以简单的访问应用表面层（下面会详述）或者使用变量 view_surface_id[0..7]将表面绑定到一个视野，视野中显示的所有内容都会绘制到给定的表面上。

source: One thing you should realise at this point is that many of the same things can be achieved in various different ways when working with GameMaker: Studio, either by choosing a command from the menu, by clicking a toolbar button, or by right clicking on a resource.
zh_cn: 值得注意的是，许多功能相同的按钮出现在 GameMaker: Studio不同的地方，

source: Operating System
zh_cn: 操作系统

source: Other ranges can be used by typing in the first and last character index of the range you wish to set in the Character Range input boxes (If a character does not lie in the range it is replaced by a space).
zh_cn: 要设置其它范围只需要在 Character Range 输入框中输入你要设置的范围的第一个和最后一个字符的编号即可（如果你使用了范围之外的字符，显示的时候会用空格代替）。

source: Our array now contains three positions (0, 1 and 2) and we have initialized our array to 0.
zh_cn: 现在我们的数组包含三个位置（0、1和2），并且我们初始化数组为0。

source: Output
zh_cn: Output（输出）

source: Parents
zh_cn: 父对

source: Particles
zh_cn: 粒子

source: Path Information
zh_cn: 路径信息

source: Path Point Control
zh_cn: 路径点控制

source: Path Toolbar
zh_cn: 路径工具栏

source: Paths
zh_cn: 路径

source: Persistent objects
zh_cn: 持续性物体

source: Physics
zh_cn: 物理效果

source: Platform Specific
zh_cn: 平台特性

source: Playing Your Games
zh_cn: 玩你的游戏

source: Please note that Mac and iOS do not return specific dpi settings but appear to return the same values as the OS, which are not correct (but will have to do) as Apple do not give the correct values.
zh_cn: 请注意Mac 和 iOS 不会返回特定的 dpi 设置，而是作为操作系统返回同一个值，这并不正确（但必须这样），因为苹果没有给出正确的值。

source: Please note that Steam users also have an additional target for compiling games which is the Steam Workshop.
zh_cn: 请注意，Steam用户还可以添加一个额外目标为 Steam 创意工坊。

source: Please note that before programing in GameMaker: Studio there are a few conventions that you should follow!
zh_cn: 请注意：在使用 GameMaker: Studio 编程之前，请遵守一些惯例。

source: Please note that for the Mac OSX target, you must have the "Start In Fullscreen" option selected in the Global Game Settings, otherwise this function will fail.
zh_cn: 请注意对于 Mac OSX 目标平台， 你 必须选中 "Start In Fullscreen" 选项，该选项在 Global Game Settings中可以找到，否则这个函数将使用无效。.

source: Please note that from now on you should edit the files stored in this folder and not the original files (unless you plan on including them again, but generally there is no need).
zh_cn: 请注意从现在开始你应当只去修改这个文件夹下的文件而不是你的原始文件（除非你打算重新包含它们，但是通常这都是不必要的）。

source: Please note that if you do not call surface_reset_target after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 请注意如果完成之后没有调用 surface_reset_target ，接下来屏幕上什么都不会绘制（即使是其它实例），而是绘制到了表面上。

source: Please note that the additional modules can only be bought for the Professional Version of GameMaker: Studio, and if you have bought GameMaker: Studio through Steam, you will also have another target platform for your game which is the Steam Workshop.
zh_cn: 请注意额外的模块只能在 GameMaker: Studio 专业版 中使用。如果你在 Steam 上购买了 GameMaker: Studio，你将会拥有 Steam Workshop 的目标模块。

source: Please note that the availability of certain tools and the number of certain resources that you can create may be restricted depending on the version of GameMaker: Studio that you use (more information can be found here).
zh_cn: 请注意某些工具的有效性和你能创建的某些资源的数目，这些可能会根据你使用 GameMaker: Studio 版本来确定 (更多信息可以在 这里找到)。

source: Please note that there is no guarantee that remote push notifications will be delivered, and that the allowed data payload is fairly small.
zh_cn: 请注意，远程推送通知不能保证一定传递成功，并且允许传送的数据的负载也非常小。

source: Please note that these are coordinates based on the surface size and not on the position at which the surface is being drawn in the room (see the main page on Surfaces for further information).
zh_cn: 请注意，这些坐标是基于表面层大小的一个位置，而不是表面层在房间内绘制的位置 （查看 表面层 目录页获取详细信息）。

source: Please note that this function may not correctly detect the orientation of the device when used in the HTML5 target module.
zh_cn: 请注意，使用HTML5目标模块时，这个函数可能不会正确的检测到设备的朝向。

source: Please note that tiles are purely graphical and do not have most of the properties you would find in an object or a sprite which is why they are fast.
zh_cn: 要注意磁贴是 纯粹的图像 而没有更多的属性所以它们能够被快速处理。

source: Please note that to start drawing to a surface you must first have called the function surface_set_target and then this one after you have finished, for each surface target that you have set or else nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 请注意，开始绘制到表面时必须调用这个函数surface_set_target，然后 对于每个你设置的表面层完成绘制时是这个函数，否则接下来将什么也不会绘制到屏幕上(即使是其它的实例) ，而是都绘制到了这个表面层上。

source: Please note that you can click the Parent button to automatically open the assigned parent object, and you can also see a list of "child" objects for the object if it is selected as the "parent" of anything else.
zh_cn: 请注意你可以点击 Parent 按钮自动打开指定父对物体，也可以看到它的子对列表。

source: Please note that you can click the Mask button to automatically open the assigned mask sprite.
zh_cn: 请注意你可以点击 Mask 按钮自动打开指定的遮罩。

source: Please note, that although it is possible to create negative time moments, it is pointless to do so as they will never be executed!
zh_cn: 请注意，虽然我们可以创建一个负数的时刻，不过这是完全没有意义的，因为它永远不会被执行！

source: Please realize that, even with a program like GameMaker: Studio, designing computer games is not completely effortless - so no "make a MMORPG" button here!
zh_cn: 请记住，即使拥有一个像 GameMaker: Studio这样的软件，也并没有 “创建一个MMORPG游戏” 按钮使得您毫不费力地创建一个游戏。

source: Populate a ds_map with the information related to the first local notification queued.
zh_cn: 返回本地通知队列的第一个信息，格式为ds_map。

source: Populate a ds_map with the information related to the next local notification in the queue.
zh_cn: 返回本地通知队列中的下一个通知，格式为 ds_map 。

source: Post draw event
zh_cn: Post draw 事件（发布绘制事件）

source: Pre-draw event
zh_cn: Pre-draw 事件

source: Pressing the Make button will open the standard GameMaker: Studio User Interface where you can begin to create your own games, but pressing the Play button will open the Steam Player:
zh_cn: 点击 Make 按钮会打开标准版 GameMaker: Studio User Interface (用户图形界面) 然后就可以开始制作你自己的游戏了，点击 Play 按钮会打开 Steam 播放器:

source: Pressing this button will clear the current asset compiler cache.
zh_cn: 按下此按钮可以清除工程编译缓存。Pressing this button will clear the current asset compiler cache.

source: Prev Page
zh_cn: 前一页

source: Print Page
zh_cn: 打印该页

source: Profile
zh_cn: Profile（概况）

source: Profiling
zh_cn: Profiling（调试分析）

source: Push Notifications
zh_cn: 推送通知

source: Push Notifications - Android
zh_cn: 推送通知 - Android

source: Push Notifications - Tizen
zh_cn: 推送通知 - Tizen

source: Push Notifications - iOS
zh_cn: 推送通知 - iOS

source: Quality And Volume
zh_cn: 品质和音量

source: Real Numbers And Strings
zh_cn: 实数和字符串

source: Referencing an array will not copy it and be faster to parse.
zh_cn: 引用一个数组更快，它不是会复制。

source: Remember that the GUI layer is always made to fit the size of the display or game window, or the application surface, so setting this value to anything other than 1 basically scales the pixel count along the width and height.
zh_cn: 记住，GUI层一向是主动适应显示器或游戏窗口的大小，或者应用表面层，所以设置这个为除1之外的任何其它值，基本是根据它们的宽高缩放像素值。

source: Remote Notifications
zh_cn: 远程通知

source: Remote notification messages are sent by a server to a service provided by the device platform App Store, and this then forwards those messages onto all the devices on which your application is installed.
zh_cn: 远程通知由对应平台的应用商店提供的推送服务发送，通知将会被发送到所有安装了你的应用的设备上。

source: Render States
zh_cn: Render States（渲染状态）

source: Resets the display and changes the anti-aliasing filtering and vsync.
zh_cn: 重置显示器，更改抗锯齿滤镜和垂直同步。

source: Resize a previously created surface.
zh_cn: 重置预先创建的表面层的大小。

source: Resource Editors
zh_cn: 资源编辑器

source: Returns if the game window is in focus or not.
zh_cn: 返回游戏窗口是否处于焦点中。

source: Returns the blue component of the colour given.
zh_cn: 返回指定颜色的蓝色值。

source: Returns the caption of the window.
zh_cn: 返回窗口的标题。

source: Returns the colour of the pixel corresponding a position in the surface.
zh_cn: 返回表面层对应位置的像素颜色。

source: Returns the current d3d device pointer.
zh_cn: 返回当前 d3d 设备指针。

source: Returns the current view being rendered.
zh_cn: 返回当前正在渲染的视野。

source: Returns the difference between two angles.
zh_cn: 返回两角差值。

source: Returns the direction, in degrees, of a vector comprised.
zh_cn: 返回组成向量的方向，以角度制形式。

source: Returns the dpi value of the x axis of the display.
zh_cn: 返回显示器X轴的dpi值。

source: Returns the dpi value of the y axis of the display.
zh_cn: 返回显示器y轴的dpi值。

source: Returns the full 32bit value for the pixel at a given coordinate on a surface.
zh_cn: 返回表面层给定坐标的32位真彩色。

source: Returns the height of the GUI.
zh_cn: 返回GUI的高度。

source: Returns the height of the display.
zh_cn: 返回显示器的高度。

source: Returns the hue of the colour given.
zh_cn: 返回给定颜色的色相。

source: Returns the id of the game window.
zh_cn: 返回游戏窗口的ID。

source: Returns the red component of the colour given.
zh_cn: 返回指定颜色的红色值。

source: Returns the saturation of the colour given.
zh_cn: 返回给定颜色的饱和度。

source: Returns the texture id for the given surface.
zh_cn: 返回给定表面层的纹理ID。

source: Returns the value of the colour given.
zh_cn: 返回给定颜色的明度。

source: Returns the width of the GUI.
zh_cn: 返回GUI的宽度。

source: Returns the width of the display.
zh_cn: 返回显示器的宽度。

source: Returns the x coordinate of the mouse in the window with respect to the given view.
zh_cn: 返回相对于给定视野鼠标的x坐标。

source: Returns the x coordinate of the mouse in the window.
zh_cn: 返回窗口内鼠标x坐标。

source: Returns the x coordinate of the mouse relative to the display.
zh_cn: 返回鼠标相对于显示器的x坐标。

source: Returns the x-coordinate of the mouse with respect to the views.
zh_cn: 返回相对于所有视野的鼠标x坐标。

source: Returns the y coordinate of the mouse in the window with respect to the given view.
zh_cn: 返回相对于给定视野的鼠标x坐标。

source: Returns the y coordinate of the mouse in the window.
zh_cn: 返回窗口内的鼠标y坐标。

source: Returns the y coordinate of the mouse relative to the display.
zh_cn: 返回相对于显示器屏幕的鼠标的y坐标。

source: Returns the y-coordinate of the mouse with respect to the views.
zh_cn: 返回相对于所有视野的y坐标。

source: Returns whether the application surface is enabled or not.
zh_cn: 返回应用表面层是否启用。

source: Returns whether the game is run in fullscreen or not.
zh_cn: 返回游戏是否正在全屏运行。

source: Rooms can be used for levels in your game or to show information or even to hold a start menu.
zh_cn: 房间可以用于显示游戏等级、信息甚至开始菜单。

source: Rotation angle used for the view in the room.
zh_cn: 房间视野使用的视野旋转角度。

source: Save a file (as a string) to the chosen cloud service.
zh_cn: 保存文件（同字符串）到所选的云服务器中。

source: Save a string to the chosen cloud service.
zh_cn: 保存字符串到所选择动云端服务器。

source: Saves a part of a surface to disc.
zh_cn: 对一个表面层的一部分进行存盘。

source: Saves a screenshot of a defined area of the game window as a .png to a given filename.
zh_cn: 将游戏窗口的一个定义区域保存为a.png文件格式的截图。

source: Saves a screenshot of the game as a *.png.
zh_cn: 保存屏幕截图为 *.png文件。

source: Saves a surface to disc.
zh_cn: 对一个表面层进行存盘。

source: Saving with this command will only save those things that have been changed since the file was opened.
zh_cn: 保存命令只会保存被修改的文件。

source: Say you want to spawn four different enemies at four different points in your game depending on a random value.
zh_cn: 假如你想在随机的位置产生四个不同的怪物。

source: Scales the GUI to the given width or height.
zh_cn: 缩放GUI为指定的长宽。

source: Scripts
zh_cn: 脚本

source: Scripts are an important part of GML and this section explains their use.
zh_cn: 脚本是GML的重要部分，这一节使用它们的使用。

source: Scripts are the way in which GameMaker: Studio permits you to design your own functions.
zh_cn: GameMaker: Studio提供脚本功能来让你设计自己的函数。

source: Scripts are written using GML (the Game Maker Language, covered in the Reference section), which is the built-in programming language that GameMaker: Studio uses.
zh_cn: 脚本是由 GameMaker:Studio 所使用的一种内建编程语言GML（Game Maker Language的缩写，更多内容参见 Reference）编写的。Scripts are written using GML (the Game Maker Language, covered in the Reference section), which is the built-in programming language that GameMaker: Studio uses.

source: Scripts can also return a value, so that they can be used in expressions.
zh_cn: 脚本也可以返回值，所以可以在表达式中使用。

source: Search
zh_cn: 搜索

source: Searching The Knowledge Base
zh_cn: 搜索知识库

source: Second Level Address Translation (SLAT)
zh_cn: 二级地址转换 (SLAT)

source: Second, you should note that surfaces require large quantities of texture memory to be used, and so you should attempt to keep them as small as possible.
zh_cn: 其次，你应该注意，使用表面需要大量的显存，所以你应该尽可能的让它们更小。

source: See the enclosed license agreement for more information on this (available on the Licences Tab).
zh_cn: 有关许可的更多信息请查阅 Licences Tab(许可标签))。

source: See the example code below.
zh_cn: 请看下面示例代码：

source: See the section on Audio Functions for further information.
zh_cn: 更多信息请查看 Audio Functions (声音函数)。

source: Selected Instance
zh_cn: Selected Instance（被选的实例）

source: Selecting any one of them will show the previously uploaded screenshot, description and tags which you can then change as you wish.
zh_cn: 选择其中一个会显示以前上传的截图、描述和标签，你可以随意更改。

source: Set the vertical synchronisation method (Windows Only).
zh_cn: 设置垂直同步的方法（只适用Windows）。

source: Set to enable (true) or disable (false) the application surface.
zh_cn: 设置为启用 (真)禁用 (假) 应用表面层。

source: Sets a local notification to be shown at a given time on a given date.
zh_cn: 设置一个给定时间日期的通知。

source: Sets a maximum width for the game window.
zh_cn: 设置窗口的最大宽度。

source: Sets a minimum width for the game window.
zh_cn: 为游戏窗口设置最小宽度。

source: Sets the MRT output target to a specific surface.
zh_cn: 设置MRT输出目标至特定表面层。

source: Sets the buffer method used on the Windows target platform.
zh_cn: 设置 Windows 目标平台的几何顶点缓冲区的方法。

source: Sets the caption of the window.
zh_cn: 设置窗口的标题。

source: Sets the colour of the region inside the game window but outside the visible views (default is black).
zh_cn: 设置游戏窗口内但是视野之外区域的颜色（默认黑色）。

source: Sets the drawing target back to the screen, which is the default setting.
zh_cn: 设置绘制目标返回屏幕，即返回默认的设置

source: Sets the drawing target to a specific surface.
zh_cn: 设置绘制目标为指定的表面层。

source: Sets the position and size of the window rectangle.
zh_cn: 设置窗口矩形的位置和大小。

source: Sets the position of the mouse in the window to the indicated values.
zh_cn: 设置窗口内的鼠标位置为指定值。
